Projects/CSEC-Hackathon/meetings.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-29 Mon 15:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CSEC - Hackathon</title>
<meta name="author" content="Faruk Becirovic" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">CSEC - Hackathon
<br />
<span class="subtitle">Meeting Notes</span>
</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7ca415b">1. <span class="todo TODO">TODO</span> Team Meeting</a>
<ul>
<li><a href="#org6faad7b">1.1. Meeting on <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-01-29 Sun&gt;</span></span></a>
<ul>
<li><a href="#org5ae73cf">1.1.1. <span class="todo TODO">TODO</span> Find appropriate codebase to use for the competition</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The organising committee will held meeting every week.
</p>

<div id="outline-container-org7ca415b" class="outline-2">
<h2 id="org7ca415b"><span class="section-number-2">1.</span> <span class="todo TODO">TODO</span> Team Meeting</h2>
<div class="outline-text-2" id="text-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2023-01-15 Sun 13:00 +1w&gt;</span></span>
</p>
</div>

<div id="outline-container-org6faad7b" class="outline-3">
<h3 id="org6faad7b"><span class="section-number-3">1.1.</span> Meeting on <span class="timestamp-wrapper"><span class="timestamp">&lt;2023-01-29 Sun&gt;</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
The overall conclusion from the meeting is that there will be three
tracks:
</p>
<ol class="org-ol">
<li>Hack-the-box</li>
<li>Capture the Flag</li>
<li>Security by Design</li>
</ol>

<p>
Track three will be devoted to DIH. The goal would be to strenghten an
existing codebase and improve the security of an application for the
medical sector in BiH.
</p>

<p>
The competition will be held over three days. First day will host the
first two tracks, wile the secod day will be devoted to the track
three.
</p>
</div>

<div id="outline-container-org5ae73cf" class="outline-4">
<h4 id="org5ae73cf"><span class="section-number-4">1.1.1.</span> <span class="todo TODO">TODO</span> Find appropriate codebase to use for the competition</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
It is necessary to find an application with the appropriate codebase
that will be used in the competition. To this end.
</p>
</div>

<ol class="org-ol">
<li><a id="org85ce787"></a><span class="todo TODO">TODO</span> Contact prof. Senka and discuss possible ETF apps<br /></li>

<li><a id="org843ebe6"></a><span class="todo TODO">TODO</span> Write a concept for the hackathon system<br /></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-01-29 Mon 00:00</p>
<p class="author">Author: Faruk Becirovic</p>
<p class="date">Created: 2024-01-29 Mon 15:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
